HloModule jit_convert_element_type, entry_computation_layout={(pred[8,2048,2048]{2,1,0:T(32,128)(4,1)})->pred[8,2048,2048]{2,1,0:T(32,128)(4,1)}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.2 (Arg_0.1: pred[8,2048,2048]) -> pred[8,2048,2048] {
  ROOT %Arg_0.1 = pred[8,2048,2048]{2,1,0} parameter(0), metadata={op_name="args[0]"}
}

