HloModule jit_convert_element_type, entry_computation_layout={(s32[2048]{0:T(1024)})->s32[2048]{0:T(1024)}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.2 (Arg_0.1: s32[2048]) -> s32[2048] {
  %Arg_0.1 = s32[2048]{0:T(1024)} parameter(0), metadata={op_name="args[0]"}
  ROOT %copy = s32[2048]{0:T(1024)} copy(%Arg_0.1)
}

